app/views/teams/index.html.erb

SELECT "records".* FROM "records" WHERE "records"."team_id" = ?  [["team_id", 99]]
---
		<ul>
			<% t.records.each do |rec| %>

SELECT "recruiting_classes".* FROM "recruiting_classes" WHERE "recruiting_classes"."team_id" = ?  [["team_id", 1]]
---

        series: [

<% randColor = ['blue', 'red', 'green', 'purple', 'black', 'lightblue', 'lightgreen'] %>
<% @teams.each do |t| %>


        {
            name: '<%= t.name %>',
            color: '<%= randColor.sample %>',
            data:

            [

            	[<%= t.recruiting_classes[0].rank.to_i %>, <%= t.records[0].result[0..1].to_i %> ],
            	[<%= t.recruiting_classes[0].rank.to_i %>, <%= t.records[1].result[0..1].to_i %> ],
            	[<%= t.recruiting_classes[0].rank.to_i %>, <%= t.records[2].result[0..1].to_i %> ],
            	[<%= t.recruiting_classes[0].rank.to_i %>, <%= t.records[3].result[0..1].to_i %> ],
            	[<%= t.recruiting_classes[0].rank.to_i %>, <%= t.records[4].result[0..1].to_i %> ],

             ]
