app/controllers/teams_controller.rb

	def index
		@teams = Team.all.joins(:recruiting_classes)
---
SELECT "teams".* FROM "teams" INNER JOIN "recruiting_classes" ON "recruiting_classes"."team_id" = "teams"."id"  ORDER BY recruiting_classes[0].sort_order